// 피보나치는 지겨웡~
// https://www.acmicpc.net/problem/17175

#include <iostream>
using namespace std;

int main(void) {
	int n;
	int dp[51] = { 0, };
	cin >> n;
	dp[0] = 1;
	dp[1] = 1;
	for (int i = 2; i <= n; i++)
		dp[i] = (dp[i - 1] + dp[i - 2] + 1) % 1000000007;
	cout << dp[n] << '\n';
}

// 피보나치를 재귀함수로 구현했을 때 함수가 호출되는 횟수
// 0 - 1 (0)
// 1 - 1 (1)
// 2 - 3 (2->1,0)
// 3 - 5 (3->2->1,0,1)
// 4 - 9 (4->3->2->1,0,1,2->1,0)
// 5 - 15 (5->4->3->2->1,0,1,2->1,0,3->2->1,0,1)
// 어차피 이것도 피보나치의 변형 -> dp[0] = 1, dp[1] = 1, dp[i] = dp[i-1] + dp[i-2] + 1
// 내가 호출되는 것 포함
